; domain
(define (domain healthcare)

  (:requirements :strips :typing)

  (:types
    location unit robot box person - object
    guide_robot - robot
    box_robot - robot
  )

  (:predicates

    (adjacent ?l1 ?l2 - location)
    (belongs ?u - unit ?l - location)
    (atl ?r - robot ?u - location)
    (at ?b - box ?l - location)
    (has ?r - box_robot ?b - box)
    (contains_bandages ?b - box)
    (has_bandages ?u - unit)
    (is_loading_point ?l - location)
    (free ?r - robot)
    (empty ?b - box)
    (in ?p - person ?u - unit)
    (inl ?p - person ?l - location)
    (accompanying ?r - guide_robot ?p - person)

  )

  (:action move_box
    :parameters (?r - box_robot ?from - location ?to - location ?b - box)
    :precondition (and (atl ?r ?from) (adjacent ?from ?to) (has ?r ?b) (at ?b ?from))
    :effect (and (not (atl ?r ?from)) (not(at ?b ?from)) (atl ?r ?to) (at ?b ?to))
  )

  (:action move_empty
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (atl ?r ?from) (adjacent ?from ?to))
    :effect (and (not (atl ?r ?from)) (atl ?r ?to))
  )

  (:action fill_box_bandages
    :parameters (?r - box_robot ?l - location ?b - box)
    :precondition (and (atl ?r ?l) (is_loading_point ?l) (empty ?b) (at ?b ?l) (free ?r))
    :effect (and (not (empty ?b)) (contains_bandages ?b) (not (free ?r)) (has ?r ?b))
  )

  (:action empty_box_bandages
    :parameters (?r - box_robot ?l - location ?b - box ?u - unit)
    :precondition (and (atl ?r ?l) (contains_bandages ?b) (belongs ?u ?l) (at ?b ?l) (has ?r ?b))
    :effect (and (not (contains_bandages ?b)) (empty ?b) (not (has ?r ?b)) (free ?r) (has_bandages ?u))
  )

  (:action start_accompany
    :parameters (?r - guide_robot ?l - location ?p - person)
    :precondition (and (atl ?r ?l) (inl ?p ?l) (free ?r))
    :effect (and (not (free ?r)) (accompanying ?r ?p))
  )

  (:action guide_person
    :parameters (?r - guide_robot ?from - location ?to - location ?p - person)
    :precondition (and (atl ?r ?from) (inl ?p ?from) (adjacent ?from ?to) (accompanying ?r ?p))
    :effect (and (not (atl ?r ?from)) (not (inl ?p ?from)) (atl ?r ?to) (inl ?p ?to))
  )

  (:action accompany
    :parameters (?r - guide_robot ?l - location ?p - person ?u - unit)
    :precondition (and (atl ?r ?l) (inl ?p ?l) (belongs ?u ?l) (accompanying ?r ?p))
    :effect (and (not (accompanying ?r ?p)) (free ?r) (in ?p ?u))
  )
)

; problem
(define (problem hc1) (:domain healthcare)
(:objects 
r1 - box_robot
r2 - guide_robot
l1 l2 l3 - location
u1 u2 u3 - unit
b1 b2 b3 - box
p1 p2 - person
)

(:init
    (adjacent l1 l2)
    (adjacent l2 l1)
    (adjacent l2 l3)
    (adjacent l3 l2)
    (is_loading_point l1)
    (belongs u1 l3)
    (belongs u2 l3)
    (belongs u3 l2)
    (at b1 l1)
    (at b2 l1)
    (at b3 l1)
    (atl r1 l2)
    (atl r2 l2)
    (inl p1 l2)
    (inl p2 l2)
    (in p1 u3)
    (in p2 u3)
    (free r1)
    (free r2)
    (empty b1)
    (empty b2)
    (empty b3)
)

(:goal (and
    (has_bandages u1)
    (has_bandages u2)
    (in p1 u2)
    (in p2 u1)
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (start_accompany r2 l2 p1)
   deleted: (free r2)
   added: (accompanying r2 p1)
   goals met: 0 of 4
2. (move_empty r1 l2 l1)
   deleted: (atl r1 l2)
   added: (atl r1 l1)
   goals met: 0 of 4
3. (fill_box_bandages r1 l1 b3)
   deleted: (empty b3) (free r1)
   added: (contains_bandages b3) (has r1 b3)
   goals met: 0 of 4
4. (move_box r1 l1 l2 b3)
   deleted: (atl r1 l1) (at b3 l1)
   added: (atl r1 l2) (at b3 l2)
   goals met: 0 of 4
5. (move_box r1 l2 l3 b3)
   deleted: (atl r1 l2) (at b3 l2)
   added: (atl r1 l3) (at b3 l3)
   goals met: 0 of 4
6. (guide_person r2 l2 l3 p1)
   deleted: (atl r2 l2) (inl p1 l2)
   added: (atl r2 l3) (inl p1 l3)
   goals met: 0 of 4
7. (accompany r2 l3 p1 u2)
   deleted: (accompanying r2 p1)
   added: (free r2) (in p1 u2)
   goals met: 1 of 4
8. (move_empty r2 l3 l2)
   deleted: (atl r2 l3)
   added: (atl r2 l2)
   goals met: 1 of 4
9. (start_accompany r2 l2 p2)
   deleted: (free r2)
   added: (accompanying r2 p2)
   goals met: 1 of 4
10. (guide_person r2 l2 l3 p2)
   deleted: (atl r2 l2) (inl p2 l2)
   added: (atl r2 l3) (inl p2 l3)
   goals met: 1 of 4
11. (accompany r2 l3 p2 u1)
   deleted: (accompanying r2 p2)
   added: (free r2) (in p2 u1)
   goals met: 2 of 4
12. (empty_box_bandages r1 l3 b3 u1)
   deleted: (contains_bandages b3) (has r1 b3)
   added: (empty b3) (free r1) (has_bandages u1)
   goals met: 3 of 4
13. (move_empty r1 l3 l2)
   deleted: (atl r1 l3)
   added: (atl r1 l2)
   goals met: 3 of 4
14. (move_empty r1 l2 l1)
   deleted: (atl r1 l2)
   added: (atl r1 l1)
   goals met: 3 of 4
15. (fill_box_bandages r1 l1 b2)
   deleted: (empty b2) (free r1)
   added: (contains_bandages b2) (has r1 b2)
   goals met: 3 of 4
16. (move_box r1 l1 l2 b2)
   deleted: (atl r1 l1) (at b2 l1)
   added: (atl r1 l2) (at b2 l2)
   goals met: 3 of 4
17. (move_box r1 l2 l3 b2)
   deleted: (atl r1 l2) (at b2 l2)
   added: (atl r1 l3) (at b2 l3)
   goals met: 3 of 4
18. (empty_box_bandages r1 l3 b2 u2)
   deleted: (contains_bandages b2) (has r1 b2)
   added: (empty b2) (free r1) (has_bandages u2)
   goals met: 4 of 4
